[
  {
    "body": "Expedia group worked with Perfect Accounting for a number of years and they were an extremely professional, accurate, and dependable payroll vendor for our needs at the time. During the time working together, Perfect Accounting onboarded quickly and smoothly, took challenges head on, and ensured the employee experience continued to be positive throughout the duration of the engagement.",
    "author": {
      "name": "Faisal Nadeem Saiyed",
      "title": "Director, People Services, APAC, Expedia, Inc.",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/12-150x150.jpg"
    }
  },
  {
    "body": "Perfect Accounting has been providing professional services including accounting and tax reporting to McDonald’s since 2009. I have been personally in touch with the team for more than three years. The team is able to apply the professional skills and judgement and deliver exemplary performance. Perfect Accounting always manages to fulfil complicated requirements and meet with tight deadline.The team also demonstrated great collaboration skill and work with various professional firms for crucial requests. I have great pleasure to continue with their services and refer this firm to others. It has been a great working with them.",
    "author": {
      "name": "Ting Ting Si",
      "title": "Senior Finance Director, Asia, McDonald’s Corporation",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/4-2-150x150.jpg"
    }
  },
  {
    "body": "Perfect Accounting has been providing secretarial and compliance advisory services to Toshiba India Private Limited (TIPL) since almost two decades. They have always supported us in a very professional manner through a dedicated team of consultants who fully understands the requirements and expectations of TIPL. TIPL really appreciates and values the services of Perfect Accounting.",
    "author": {
      "name": "Kazutaka Nishimura",
      "title": "Director, Toshiba India Private Limited",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/4-2-150x150.jpg"
    }
  },
  {
    "body": "When I co-founded CX Partners LLP, a USD 515 million private equity fund in 2008, we selected Perfect Accounting from among 5 other shortlisted firms to be our exclusive providers of accounting and tax services. It is a decision I have never regretted. Perfect Accounting provided us excellent service and tax advice. They were super- efficient, responsive and a pleasure to work with. I continue to employ their services for my personal tax administration, and am extremely happy with them.",
    "author": {
      "name": "Ajay Relan",
      "title": "Co-Founder, CX Partners LLP, Ex-MD of Citigroup Venture Capital International",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/5-1-150x150.jpg"
    }
  },
  {
    "body": "Perfect Accounting has been my trusted tax and financial advisors; both while in India and during our international stints for about 30 years. During these long and enduring professional association, I have found them to be extremely professional, knowledgeable in an international sense, highly customer oriented and friendly with problem solving mindset. I continue to be impressed by their professional ‘can do’ and responsive attitude irrespective of time or geographic differences. I’ve dealt with many organizations and firms and our continuing association is a testimony to Perfect Accounting's focus on professional excellence. I wish Narendra, Mayank and Perfect Accounting the very best and continued success.",
    "author": {
      "name": "Dr. Mohan Kumar",
      "title": "Ex Global HR Head, Standard Chartered Bank, Singapore",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/11-150x150.jpg"
    }
  },
  {
    "body": "Perfect Accounting has been my accounting and tax compliance agency for over fifteen years and all my family members (including for myself) tax returns are being prepared and filed by them and also the assessments are being handled by them. Their services resemble their name “Perfect” and I am very happy with the services rendered by them. The people handling the services are knowledgeable about their subjects and are very humble.",
    "author": {
      "name": "Raj Kumar Agrawal",
      "title": "Sr. Partner, S.R. Batliboi & Co. LLP",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/6-1-150x150.jpg"
    }
  },
  {
    "body": "We have a long association with Perfect Accounting for more than 15 years. Whilst the engagement was primarily handling our accounting and secretarial functions which the firm did with exemplary professionalism, we also used them sporadically for advice and matters pertaining to taxation and RBI. Over the years their relationship with us blossomed and we have currently retained Perfect Accounting to undertake the Liquidation of our Firm.",
    "author": {
      "name": "Vishal Marwaha",
      "title": "Partner, Henderson Private Capital, UK",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/3-1-150x150.jpg"
    }
  },
  {
    "body": "When Flos Architectural decided to open a branch office in India, we chose Perfect Accounting for their experience in working with other multinational firms, their expertise in local taxes and legislation and the attitude of their people, always ready to a prompt reply. We needed an effective and affordable way to ensure 100% local compliance and control of our operations in India, and Perfect Accounting has been key to achieve this goal.",
    "author": {
      "name": "Arturo Miquel",
      "title": "CFO, FLOS Architectural, Spain",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/1-1-150x150.jpg"
    }
  },
  {
    "body": "Perfect Accounting provides Bombardier, Aviation (India) a wide gamut of financial services including taxation and audit services. We are highly pleased on their timely and quality services since last 9 years. Perfect Accounting is very proactive on their multiple deliveries and addressing our queries on time since years. They are highly professional with attention to details. They have in depth knowledge in accounting and financial services for corporates. Kudos to Perfect Accounting on their continuous journey on excellence.",
    "author": {
      "name": "Manaswi Maharana",
      "title": "Head of Engineering, Operations; Bombardier Aerospace, India",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/10-1-150x150.jpg"
    }
  },
  {
    "body": "I highly recommend Perfect Accounting. In my view, Perfect Accounting has all the qualifications required of this responsible position and carried through on assigned tasks. Their skills in dealing with clients were outstanding.",
    "author": {
      "name": "Jun Kobayashi",
      "title": "India Bureau Chief, NHK Japan Broadcasting Corporation",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/7-1-150x150.jpg"
    }
  },
  {
    "body": "Many thanks for fantastic service. If only we could replicate your levels.",
    "author": {
      "name": "Ram Sarvepalli",
      "title": "Deputy Managing Partner, Advisory for EMIA, Ernst & Young LLP, UK",
      "image": "https://perfectaccounting.in/wp-content/uploads/2020/06/8_1-150x150.jpg"
    }
  }
]